# 思科二层交换机配置教程

## 1.开始前准备
> 如果是新的交换机可以直接进入下一节直接进行配置；
> 如果是旧的交换机，首先先把交换机恢复出厂设置在进行配置；
### 1.1 恢复出厂
**一、硬重启**
> 长按MODE键12秒左右，交换机下面三个灯会闪，松开后就恢复出厂设置了。

**二、命令恢复出厂设置**
```
delete vlan.dat
delete config.text
reload
Compiled Wed 20-Jul-11 06:23 by prod_rel_team 回车
Would you like to enter the initial configuration dialog? [yes/no]: n
```

## 2. 修改交换机名称
```
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname XXX
```

## 3. 配置密码
### 3.1 配置console密码
```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#line console 0
Switch(config-line)#pas
Switch(config-line)#password XXX
Switch(config-line)#login
Switch(config-line)#exit
```
### 3.2 配置全局密码
```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#enable se
Switch(config)#enable secret XXX
```

# 4. 配置2层交换机的管理IP
```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int vlan 178
Switch(config-if)#ip address x.x.x.x(IP地址)  x.x.x.x(子网掩码)
Switch(config-if)#end
```

## 5. 配置VTP
```
Switch(config)#vtp mode client					    //设置VTP模式为客户端
Switch(config)#vtp domain XXX				        //设置域名为XXX
Changing VTP domain name from NULL to XXX		
Switch(config)#vtp password XX					    //设置密码为SHZ
Setting device VTP password to XXX			
Switch(config)#ntp server x.x.x.x			        //设置时间同步服务器指向核心交换机
Switch(config)#clock timezone Beijing 8			    // 设置时区
```

## 6. 配置SSH
### 6.1 配置hostname和domain-name
生成RSA密钥后SSH服务会自动开启，删除RSA后SSH服务关闭，RSA密钥又是用hostname和domain-name产生的，所以要配置这两项
```
Switch(config)#hostname xxx
Switch(config)#ip domain-name xxx
```
### 6.2 生成RSA密钥()
```
Switch(config)#cpypto key generae rsa //生成RSA,后续会有提示需要多少为的加密
Switch(config)#cpypto key zeroise rsa //删除RSA
```
### 6.3 配置用户名和密码
```
Switch(config)# username xxxx privilege 0 passwd xxx    //privilege为0时不会自动进入特权模式
```
### 6.4配置VTY终端
```
Switch(config)#vty 0 4 
Switch(config-line)#transport input ssh         //只允许SSH协议
Switch(config-line)#login local                 //本地密码检测  
Switch(config-line)#
```
## 6.5 SSH其他设置
```
ip ssh time-out 120                 //ssh认证超时时间，单位秒
exec-time                           //超时时间
ip ssh authentication-retires       //ssh认证失败次数
```